In [43]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

In [44]:
df = pd.read_csv('Data.csv')

In [45]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [46]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [47]:
imputer = SimpleImputer(missing_values= np.nan, strategy='mean')
df[['Age']] = imputer.fit_transform(df[['Age']])
df[['Salary']] = imputer.fit_transform(df[['Salary']])

In [48]:
df

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [49]:
df.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64